In [1]:
# Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd 
var = [4,8,15,16,23,42]
sr = pd.Series(var)
print(sr)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
#Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

var1 = [1,2,3,4,5,6,7,8,9,10]
a = pd.Series(var1)
print(a)

a.head() # it will print first five element

a.tail() # it will print last five elememnt

type(a) # it determine type of variable a.

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

pandas.core.series.Series

In [3]:
'''Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire
Age
25
30
27
Gender
Female
Male
Female
Then, print the DataFrame.'''

import pandas as pd

df = ({"name":['Alice','Bob','Claire'], "Age":[25,30,27], "Gender":['Female','Male','Female']})
s = pd.DataFrame(df)
print(s)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [4]:
# What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
'''
DataFrame is two dimwnsional, size mutable and heterogenous tabular data structure. it can be spreadsheet or sql table where data 
is organised in rows and columns.on the other hand series is one dimensional labelled capable of holding any datatype it is similar
to numpy array but come with additional functionalities and associated index.

'''
# series example
a = [10,20,30,40]
s = pd.Series(a)
print(s)

print()

x = ({"name":['juhi','anjali','aman'],"sub":['python','c++','java']})
df = pd.DataFrame(x)
print(df)

0    10
1    20
2    30
3    40
dtype: int64

     name     sub
0    juhi  python
1  anjali     c++
2    aman    java

In [18]:
#What are some common functions you can use to manipulate data in a Pandas DataFrame? Canyou give an example of when you might
#use one of these functions?



import lxml
import pandas as pd 
url_data = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html") # extracting data of given link 

type(url_data)
len(url_data)

df = url_data[0] #html data will converted into dataframe

print(df)

df.head # print first five data
print()

df.tail # print last five data

df.columns # print all columns in dataframe

df.dtypes # list out the all columns datatypes

df[['AST','TOV']] # with the help of  this function you can print any two or three column you want.

      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

     DRB  TRB  AST  STL BLK  TOV   PF   PTS
0    222  301   68   27  22   60  147   398
1     19   28   16   16   7   14   24    94
2    324  523   66   38  86   99  222   537
3     54   77   15    4   9    9   30    60
4    220  247  129   41   7  116  167  1035
..   ...  ...  ...  ...  ..  ...  ...   ...
670  284  411  173  124  25  117  171  1071
671  170  245  135   86  17   75  115   685
672  114  166   38   38   8   42   56   386
673  265  362  100   34  49   62  156   472
674  319  465  113   18  52   76  205   833

[675 rows x 30 columns]

     AST  TOV
0     68   60
1     16   14
2     66   99
3     15    9
4    129  116
..   ...  ...
670  173  117
671  135   75
672   38   42
673  100   62
674  113   76

[675 rows x 2 columns]

In [ ]:
# Which of the following is mutable in nature Series, DataFrame, Panel?

'''
in pandas series are mutable which means you can modify its data chnage the index label and remove or add elements after creation.
DataFrame is also mutable you can add or delete column,modify data in specific cell,append rows and can perform differemt operation
panel is an immmutable it used to handle three dimensional data.
'''

In [ ]:
#Create a DataFrame using multiple Series. Explain with an example.

a = ({"sr":pd.Series([1,2,3,4], ""))